In [1]:
import pandas as pd
df = pd.read_csv('supershop.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

#### Max Absolute Scaler

In [2]:
from sklearn.preprocessing import MaxAbsScaler

In [3]:
max_scaler = MaxAbsScaler()

In [4]:
max_scaler

MaxAbsScaler()

#### Use Fit Transform

In [6]:
max_scaler_fit = max_scaler.fit(df[['Marketing Spend']]) # model fit

In [7]:
max_scaler_fit

MaxAbsScaler()

In [7]:
df['Marketing Spend'] = max_scaler.transform(df[['Marketing Spend']]) # transform

In [8]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530       136897.80  471784.10    Dhaka  192261.83
1         1.452113       151377.59  443898.53      Ctg  191792.06
2         1.303634       101145.55  407934.54  Rangpur  191050.39
3         1.156567       118671.85  383199.62    Dhaka  182901.99
4         1.119836        91391.77  366168.42  Rangpur  166187.94

In [9]:
# together use of fit and transform
df.Administration = robust_scaler.fit_transform(df[['Administration']])

In [10]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530        0.345355  471784.10    Dhaka  192261.83
1         1.452113        0.697565  443898.53      Ctg  191792.06
2         1.303634       -0.524290  407934.54  Rangpur  191050.39
3         1.156567       -0.097977  383199.62    Dhaka  182901.99
4         1.119836       -0.761543  366168.42  Rangpur  166187.94

#### Use fit Transform for all column

In [11]:
import pandas as pd
df2 = pd.read_csv('supershop.csv')

df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [12]:
x = df2.drop('Profit', axis=1) # axis for row 0, column 1
y = df2['Profit']

In [13]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [14]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

In [15]:
# delete multiple column
new_x = df2.drop(['Area', 'Profit'], axis=1) 
new_x.head()

   Marketing Spend  Administration  Transport
0        114523.61       136897.80  471784.10
1        162597.70       151377.59  443898.53
2        153441.51       101145.55  407934.54
3        144372.41       118671.85  383199.62
4        142107.34        91391.77  366168.42

In [16]:
newx = robust_scaler.fit_transform(new_x)

In [17]:
newx.shape

(50, 3)

In [18]:
newx[0:5, 0:3]

array([[ 0.67253009,  0.34535525,  1.55201644],
       [ 1.45211292,  0.6975647 ,  1.38371396],
       [ 1.3036336 , -0.52428997,  1.16665443],
       [ 1.15656655, -0.09797658,  1.0173676 ],
       [ 1.11983554, -0.76154296,  0.91457633]])

In [19]:
data = pd.DataFrame(newx, columns=['Marketing Spend', 'Administration', 'Transport'])

In [20]:
data.head()

   Marketing Spend  Administration  Transport
0         0.672530        0.345355   1.552016
1         1.452113        0.697565   1.383714
2         1.303634       -0.524290   1.166654
3         1.156567       -0.097977   1.017368
4         1.119836       -0.761543   0.914576